tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66j90_tdd.h
#define RC6                           522
#define CK1                           523
#define RX1                           524
#define SEG28                         525
#define RC7                           526
#define DT1                           527
#define PORTD                         528
#define RD0                           529
#define SEG0                          530
#define CTPLS                         531
#define RD1                           532
#define SEG1                          533
#define RD2                           534
#define SEG2                          535
#define RD3                           536
#define SEG3                          537
#define RD4                           538
#define SEG4                          539
#define RD5                           540
#define SEG5                          541
#define RD6                           542
#define SEG6                          543
#define RD7                           544
#define SEG7                          545
#define SS2                           546
#define PORTE                         547
#define PD2                           548
#define RDE                           549
#define LCDBIAS1                      550
#define RE0                           551
#define WRE                           552
#define LCDBIAS2                      553
#define PC2                           554
#define RE1                           555
#define COM0                          556
#define CCP9E                         557
#define RE3                           558
#define PC3E                          559
#define PB3E                          560
#define COM1                          561
#define RE4                           562
#define CCP8E                         563
#define COM2                          564
#define CCP7E                         565
#define RE5                           566
#define PC1E                          567
#define CCP6E                         568
#define COM3                          569
#define RE6                           570
#define PB1E                          571
#define PORTE_CCP2                    572
#define CCP2E                         573
#define SEG31                         574
#define PA2E                          575
#define RE7                           576
#define PORTF                         577
#define SEG19                         578
#define C2OUTF                        579
#define AN6                           580
#define PORTF_C2OUT                   581
#define RF1                           582
#define PORTF_C1OUT                   583
#define AN7                           584
#define RF2                           585
#define C1OUTF                        586
#define SEG20                         587
#define AN8                           588
#define RF3                           589
#define SEG21                         590
#define C2INB                         591
#define AN9                           592
#define RF4                           593
#define SEG22                         594
#define C2INA                         595
#define C1INB                         596
#define RF5                           597
#define SEG23                         598
#define CVREF                         599
#define AN10                          600
#define C1INA                         601
#define RF6                           602
#define SEG24                         603
#define AN11                          604
#define SS1                           605
#define AN5                           606
#define RF7                           607
#define SEG25                         608
#define PORTG                         609
#define LCDBIAS0                      610
#define RG0                           611
#define C3OUTG                        612
#define TX2                           613
#define RG1                           614
#define CK2                           615
#define VLCAP1                        616
#define RX2                           617
#define RG2                           618
#define DT2                           619
#define VLCAP2                        620
#define RG3                           621
#define SEG26                         622
#define RG4                           623
#define RTCC                          624
#define PORTG_RJPU                    625
#define RG5                           626
#define REPU                          627
#define RG6                           628
#define RDPU                          629
#define RG7                           630
#define LATA                          631
#define LATA0                         632
#define LA0                           633
#define LATA1                         634
#define LA1                           635
#define LATA2                         636
#define LA2                           637
#define LATA3                         638
#define LA3                           639
#define LATA4                         640
#define LA4                           641
#define LATA5                         642
#define LA5                           643
#define LATA6                         644
#define LA6                           645
#define LATA7                         646
#define LA7                           647
#define LATB                          648
#define LB0                           649
#define LATB0                         650
#define LB1                           651
#define LATB1                         652
#define LB2                           653
#define LATB2                         654
#define LB3                           655
#define LATB3                         656
#define LB4                           657
#define LATB4                         658
#define LB5                           659
#define LATB5                         660
#define LB6                           661
#define LATB6                         662
#define LB7                           663
#define LATB7                         664
#define LATC                          665
#define LATC0                         666
#define LC0                           667
#define LATC1                         668
#define LC1                           669
#define LATC2                         670
#define LC2                           671
#define LATC3                         672
#define LC3                           673
#define LATC4                         674
#define LC4                           675
#define LATC5                         676
#define LC5                           677
#define LATC6                         678
#define LC6                           679
#define LATC7                         680
#define LC7                           681
#define LATD                          682
#define LATD0                         683
#define LD0                           684
#define LATD1                         685
#define LD1                           686
#define LATD2                         687
#define LD2                           688
#define LATD3                         689
#define LD3                           690
#define LATD4                         691
#define LD4                           692
#define LATD5                         693
#define LD5                           694
#define LATD6                         695
#define LD6                           696
#define LATD7                         697
#define LD7                           698
#define LATE                          699
#define LATE0                         700
#define LE0                           701
#define LATE1                         702
#define LE1                           703
#define LATE3                         704
#define LE3                           705
#define LATE4                         706
#define LE4                           707
#define LATE5                         708
#define LE5                           709
#define LATE6                         710
#define LE6                           711
#define LATE7                         712
#define LE7                           713
#define LATF                          714
#define LATF1                         715
#define LF1                           716
#define LF2                           717
#define LATF2                         718
#define LF3                           719
#define LATF3                         720
#define LF4                           721
#define LATF4                         722
#define LF5                           723
#define LATF5                         724
#define LF6                           725
#define LATF6                         726
#define LF7                           727
#define LATF7                         728
#define LATG                          729
#define LATG0                         730
#define LG0                           731
#define LATG1                         732
#define LG1                           733
#define LG2                           734
#define LATG2                         735
#define LATG3                         736
#define LG3                           737
#define LATG4                         738
#define LG4                           739
#define U1OD                          740
#define U2OD                          741
#define TRISA                         742
#define TRISA0                        743
#define TRISA1                        744
#define TRISA2                        745
#define TRISA3                        746
#define TRISA4                        747
#define TRISA5                        748
#define TRISA6                        749
#define TRISA7                        750
#define TRISB                         751
#define TRISB0                        752
#define TRISB1                        753
#define TRISB2                        754
#define TRISB3                        755
#define TRISB4                        756
#define TRISB5                        757
#define TRISB6                        758
#define TRISB7                        759
#define TRISC                         760
#define TRISC0                        761
#define TRISC1                        762
#define TRISC2                        763
#define TRISC3                        764
#define TRISC4                        765
#define TRISC5                        766
#define TRISC6                        767
#define TRISC7                        768
#define TRISD                         769
#define TRISD0                        770
#define TRISD1                        771
#define TRISD2                        772
#define TRISD3                        773
#define TRISD4                        774
#define TRISD5                        775
#define TRISD6                        776
#define TRISD7                        777
#define TRISE                         778
#define TRISE0                        779
#define TRISE1                        780
#define TRISE3                        781
#define TRISE4                        782
#define TRISE5                        783
#define TRISE6                        784
#define TRISE7                        785
#define TRISF                         786
#define TRISF1                        787
#define TRISF2                        788
#define TRISF3                        789
#define TRISF4                        790
#define TRISF5                        791
#define TRISF6                        792
#define TRISF7                        793
#define TRISG                         794
#define TRISG0                        795
#define TRISG1                        796
#define TRISG2                        797
#define TRISG3                        798
#define TRISG4                        799
#define CCP1OD                        800
#define CCP2OD                        801
#define SPIOD                         802
#define OSCTUNE                       803
#define TUN0                          804
#define TUN                           805
#define TUN1                          806
#define TUN2                          807
#define TUN3                          808
#define TUN4                          809
#define TUN5                          810
#define PLLEN                         811
#define INTSRC                        812
#define PIE1                          813
#define TMR1IE                        814
#define TMR2IE                        815
#define SSPIE                         816
#define SSP1IE                        817
#define TXIE                          818
#define TX1IE                         819
#define RCIE                          820
#define RC1IE                         821
#define ADIE                          822
#define PIR1                          823
#define TMR1IF                        824
#define TMR2IF                        825
#define SSP1IF                        826
#define SSPIF                         827
#define TXIF                          828
#define TX1IF                         829
#define RCIF                          830
#define RC1IF                         831
#define ADIF                          832
#define IPR1                          833
#define TMR1IP                        834
#define TMR2IP                        835
#define SSPIP                         836
#define SSP1IP                        837
#define TX1IP                         838
#define TXIP                          839
#define RCIP                          840
#define RC1IP                         841
#define ADIP                          842
#define PIE2                          843
#define TMR3IE                        844
#define LVDIE                         845
#define BCLIE                         846
#define BCL1IE                        847
#define CMIE                          848
#define OSCFIE                        849
#define PIR2                          850
#define TMR3IF                        851
#define LVDIF                         852
#define BCL1IF                        853
#define BCLIF                         854
#define CMIF                          855
#define OSCFIF                        856
#define IPR2                          857
#define TMR3IP                        858
#define LVDIP                         859
#define BCL1IP                        860
#define BCLIP                         861
#define CMIP                          862
#define OSCFIP                        863
#define PIE3                          864
#define RTCCIE                        865
#define RXB0IE                        866
#define RXBNIE                        867
#define CCP1IE                        868
#define RXB1IE                        869
#define CCP2IE                        870
#define TXB0IE                        871
#define CTMUIE                        872
#define TXB1IE                        873
#define TXB2IE                        874
#define TXBNIE                        875
#define TX2IE                         876
#define RC2IE                         877
#define LCDIE                         878
#define PIR3                          879
#define RTCCIF                        880
#define RXBNIF                        881
#define CCP1IF                        882
#define CCP2IF                        883
#define CTMUIF                        884
#define TXBNIF                        885
#define TX2IF                         886
#define RC2IF                         887
#define LCDIF                         888
#define IPR3                          889
#define RTCCIP                        890
#define CCP1IP                        891
#define RXBNIP                        892
#define CCP2IP                        893
#define CTMUIP                        894
#define TX2IP                         895
#define TXBNIP                        896
#define RC2IP                         897
#define LCDIP                         898
#define EECON1                        899
#define WR                            900
#define WREN                          901
#define WRERR                         902
#define FREE                          903
#define WPROG                         904
#define EECON2                        905
#define LCDCON                        906
#define LMUX0                         907
#define LMUX1                         908
#define CS0                           909
#define LCDCS0                        910
#define CS1                           911
#define LCDCS1                        912
#define WERR                          913
#define LCDWERR                       914
#define LCDSLPEN                      915
#define SLPEN                         916
#define LCDEN                         917
#define LCDSE0                        918
#define SE0                           919
#define SEGEN0                        920
#define SE00                          921
#define SE1                           922
#define SEGEN1                        923
#define SE01                          924
#define SE2                           925
#define SEGEN2                        926
#define SE02                          927
#define SE3                           928
#define SEGEN3                        929
#define SE03                          930
#define SE4                           931
#define SEGEN4                        932
#define SE04                          933
#define SE5                           934
#define SE05                          935
#define SEGEN5                        936
#define SE6                           937
#define SE06                          938
#define SEGEN6                        939
#define SE07                          940
#define SE7                           941
#define SEGEN7                        942
#define LCDPS                         943
#define LP0                           944
#define LCDPS0                        945
#define LP1                           946
#define LCDPS1                        947
#define LP2                           948
#define LCDPS2                        949
#define LP3                           950
#define LCDPS3                        951
#define WA                            952
#define LCDA                          953
#define BIASMD                        954
#define WFT                           955
#define RCSTA1                        956
#define RCSTA1_RX9D                   957
#define RX9D1                         958
#define RCSTA1_RCD8                   959
#define RCSTA1_OERR                   960
#define OERR1                         961
#define RCSTA1_FERR                   962
#define FERR1                         963
#define RCSTA1_ADDEN                  964
#define ADDEN1                        965
#define ADEN                          966
#define RCSTA1_CREN                   967
#define CREN1                         968
#define SRENA                         969
#define SREN1                         970
#define RCSTA1_SREN                   971
#define RCSTA1_NOT_RC8                972
#define RCSTA1_RC9                    973
#define RCSTA1_RC8_9                  974
#define RCSTA1_RX9                    975
#define nRC8                          976
#define RX91                          977
#define RCSTA1_SPEN                   978
#define SPEN1                         979
#define TXSTA1                        980
#define TX9D1                         981
#define TXSTA1_TX9D                   982
#define TXSTA1_TXD8                   983
#define TRMT1                         984
#define TXSTA1_TRMT                   985
#define BRGH1                         986
#define TXSTA1_BRGH                   987
#define SENDB1                        988
#define SENDB                         989
#define TXSTA1_SYNC                   990
#define SYNC1                         991
#define TXEN1                         992
#define TXSTA1_TXEN                   993
#define TX91                          994
#define TXSTA1_NOT_TX8                995
#define TXSTA1_TX8_9                  996
#define TXSTA1_TX9                    997
#define nTX8                          998
#define TXSTA1_CSRC                   999
#define CSRC1                         1000
#define TXREG1                        1001
#define RCREG1                        1002
#define SPBRG1                        1003
#define T3CON                         1004
#define TMR3ON                        1005
#define TMR3CS                        1006
#define nT3SYNC                       1007
#define NOT_T3SYNC                    1008
#define T3SYNC                        1009
#define T3INSYNC                      1010
#define SOSCEN3                       1011
#define T3CCP1                        1012
#define T3CKPS                        1013
#define T3CKPS0                       1014
#define T3CKPS1                       1015
#define T3CCP2                        1016
#define T3CON_RD16                    1017
#define RD163                         1018
#define T3RD16                        1019
#define TMR3L                         1020
#define TMR3H                         1021
#define CMCON                         1022
#define CMEN0                         1023
#define CMCON_CM                      1024
#define CM0                           1025
#define CMEN1                         1026
#define CM1                           1027
#define CMEN2                         1028
#define CM2                           1029
#define CIS                           1030
#define C1INV                         1031
#define C2INV                         1032
#define CMCON_C1OUT                   1033
#define CMCON_C2OUT                   1034
#define CVRCON                        1035
#define CVR                           1036
#define CVR0                          1037
#define CVR1                          1038
#define CVR2                          1039
#define CVR3                          1040
#define CVRSS                         1041
#define CVRR                          1042
#define CVROEN                        1043
#define CVROE                         1044
#define CVREN                         1045
#define SE08                          1046
#define SE8                           1047
#define SEGEN8                        1048
#define LCDSE1                        1049
#define SEGEN9                        1050
#define SE09                          1051
#define SE9                           1052
#define SEGEN10                       1053
#define SE10                          1054
#define SEGEN11                       1055
#define SE11                          1056
#define SEGEN12                       1057
#define SE12                          1058
#define SEGEN13                       1059
#define SE13                          1060
#define SEGEN14                       1061
#define SE14                          1062
#define SEGEN15                       1063
#define SE15                          1064
#define SEGEN16                       1065
#define LCDSE2                        1066
#define SE16                          1067
#define SEGEN17                       1068
#define SE17                          1069
#define SEGEN18                       1070
#define SE18                          1071
#define SEGEN19                       1072
#define SE19                          1073
#define SE20                          1074
#define SEGEN20                       1075
#define SE21                          1076
#define SEGEN21                       1077
#define SEGEN22                       1078
#define SE22                          1079
#define SEGEN23                       1080
#define SE23                          1081
#define SE24                          1082
#define SEGEN24                       1083
#define LCDSE3                        1084
#define SE25                          1085
#define SEGEN25                       1086
#define SE26                          1087
#define SEGEN26                       1088
#define SE27                          1089
#define SEGEN27                       1090
