tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66j90_tdd.h
#define SE28                          1091
#define SEGEN28                       1092
#define SEGEN29                       1093
#define SE29                          1094
#define SE30                          1095
#define SEGEN30                       1096
#define SEGEN31                       1097
#define SE31                          1098
#define SEGEN32                       1099
#define SE32                          1100
#define LCDSE4                        1101
#define SEG0COM0                      1102
#define LCDDATA0                      1103
#define S00C0                         1104
#define S0C0                          1105
#define S01C0                         1106
#define SEG1COM0                      1107
#define S1C0                          1108
#define S02C0                         1109
#define S2C0                          1110
#define SEG2COM0                      1111
#define S03C0                         1112
#define SEG3COM0                      1113
#define S3C0                          1114
#define SEG4COM0                      1115
#define S4C0                          1116
#define S04C0                         1117
#define S5C0                          1118
#define S05C0                         1119
#define SEG5COM0                      1120
#define SEG6COM0                      1121
#define S6C0                          1122
#define S06C0                         1123
#define SEG7COM0                      1124
#define S7C0                          1125
#define S07C0                         1126
#define S08C0                         1127
#define LCDDATA1                      1128
#define S8C0                          1129
#define SEG8COM0                      1130
#define SEG9COM0                      1131
#define S09C0                         1132
#define S9C0                          1133
#define S10C0                         1134
#define SEG10COM0                     1135
#define S11C0                         1136
#define SEG11COM0                     1137
#define S12C0                         1138
#define SEG12COM0                     1139
#define S13C0                         1140
#define SEG13COM0                     1141
#define S14C0                         1142
#define SEG14COM0                     1143
#define SEG15COM0                     1144
#define S15C0                         1145
#define LCDDATA2                      1146
#define S16C0                         1147
#define SEG16COM0                     1148
#define SEG17COM0                     1149
#define S17C0                         1150
#define SEG18COM0                     1151
#define S18C0                         1152
#define S19C0                         1153
#define SEG19COM0                     1154
#define S20C0                         1155
#define SEG20COM0                     1156
#define S21C0                         1157
#define SEG21COM0                     1158
#define SEG22COM0                     1159
#define S22C0                         1160
#define S23C0                         1161
#define SEG23COM0                     1162
#define LCDDATA3                      1163
#define S24C0                         1164
#define SEG24COM0                     1165
#define S25C0                         1166
#define SEG25COM0                     1167
#define S26C0                         1168
#define SEG26COM0                     1169
#define SEG27COM0                     1170
#define S27C0                         1171
#define SEG28COM0                     1172
#define S28C0                         1173
#define SEG29COM0                     1174
#define S29C0                         1175
#define S30C0                         1176
#define SEG30COM0                     1177
#define SEG31COM0                     1178
#define S31C0                         1179
#define S32C0                         1180
#define LCDDATA4                      1181
#define SEG32COM0                     1182
#define SEG33COM0                     1183
#define S33C0                         1184
#define S34C0                         1185
#define SEG34COM0                     1186
#define S35C0                         1187
#define SEG35COM0                     1188
#define S36C0                         1189
#define SEG36COM0                     1190
#define SEG37COM0                     1191
#define S37C0                         1192
#define S38C0                         1193
#define SEG38COM0                     1194
#define SEG39COM0                     1195
#define S39C0                         1196
#define ADCON2                        1197
#define ADCS0                         1198
#define ADCS                          1199
#define ADCS1                         1200
#define ADCS2                         1201
#define ACQT0                         1202
#define ACQT                          1203
#define ACQT1                         1204
#define ACQT2                         1205
#define ADFM                          1206
#define ADCON1                        1207
#define PCFG0                         1208
#define PCFG                          1209
#define PCFG1                         1210
#define PCFG2                         1211
#define CHSN3                         1212
#define PCFG3                         1213
#define VCFG                          1214
#define VCFG0                         1215
#define VCFG01                        1216
#define VCFG11                        1217
#define VCFG1                         1218
#define TRIGSEL                       1219
#define ADCON0                        1220
#define ADON                          1221
#define nDONE                         1222
#define GO_nDONE                      1223
#define NOT_DONE                      1224
#define GODONE                        1225
#define GO_DONE                       1226
#define DONE                          1227
#define GO                            1228
#define GO_NOT_DONE                   1229
#define CHS                           1230
#define CHS0                          1231
#define CHS1                          1232
#define CHS2                          1233
#define CHS3                          1234
#define ADCAL                         1235
#define ADRESL                        1236
#define ADRESH                        1237
#define SSP1CON2                      1238
#define SEN1                          1239
#define SEN                           1240
#define ADMSK11                       1241
#define RSEN1                         1242
#define RSEN                          1243
#define ADMSK1                        1244
#define PEN                           1245
#define ADMSK21                       1246
#define PEN1                          1247
#define ADMSK2                        1248
#define ADMSK31                       1249
#define RCEN                          1250
#define RCEN1                         1251
#define ADMSK3                        1252
#define ACKEN                         1253
#define ACKEN1                        1254
#define ADMSK41                       1255
#define ADMSK4                        1256
#define ACKDT1                        1257
#define ADMSK51                       1258
#define ADMSK5                        1259
#define ACKDT                         1260
#define ACKSTAT                       1261
#define ACKSTAT1                      1262
#define GCEN                          1263
#define GCEN1                         1264
#define SSP1CON1                      1265
#define SSPM0                         1266
#define SSPM                          1267
#define SSPM01                        1268
#define SSPM1                         1269
#define SSPM11                        1270
#define SSPM2                         1271
#define SSPM21                        1272
#define SSPM31                        1273
#define SSPM3                         1274
#define CKP                           1275
#define CKP1                          1276
#define SSPEN                         1277
#define SSPEN1                        1278
#define SSPOV1                        1279
#define SSPOV                         1280
#define WCOL1                         1281
#define WCOL                          1282
#define SSP1STAT                      1283
#define BF                            1284
#define BF1                           1285
#define UA1                           1286
#define UA                            1287
#define R_NOT_W                       1288
#define READ_WRITE                    1289
#define RW1                           1290
#define NOT_W                         1291
#define I2C_READ                      1292
#define nW                            1293
#define RW                            1294
#define nWRITE                        1295
#define R                             1296
#define NOT_WRITE                     1297
#define R_nW                          1298
#define R_W                           1299
#define START                         1300
#define START1                        1301
#define S                             1302
#define I2C_START                     1303
#define STOP                          1304
#define STOP1                         1305
#define I2C_STOP                      1306
#define P                             1307
#define NOT_A                         1308
#define nA                            1309
#define D_A                           1310
#define D_nA                          1311
#define D                             1312
#define DA1                           1313
#define DA                            1314
#define DATA_ADDRESS                  1315
#define D_NOT_A                       1316
#define NOT_ADDRESS                   1317
#define nADDRESS                      1318
#define I2C_DAT                       1319
#define CKE                           1320
#define CKE1                          1321
#define SMP                           1322
#define SMP1                          1323
#define SSP1ADD                       1324
#define SSP1ADD_MSK0                  1325
#define MSK01                         1326
#define SSPADD                        1327
#define SSP1ADD_MSK1                  1328
#define MSK11                         1329
#define SSP1ADD_MSK2                  1330
#define MSK21                         1331
#define MSK31                         1332
#define SSP1ADD_MSK3                  1333
#define SSP1ADD_MSK4                  1334
#define MSK41                         1335
#define MSK51                         1336
#define SSP1ADD_MSK5                  1337
#define MSK61                         1338
#define SSP1ADD_MSK6                  1339
#define SSP1ADD_MSK7                  1340
#define MSK71                         1341
#define SSP1BUF                       1342
#define SSPBUF                        1343
#define T2CON                         1344
#define T2CKPS0                       1345
#define T2CKPS                        1346
#define T2CKPS1                       1347
#define TMR2ON                        1348
#define T2OUTPS0                      1349
#define T2OUTPS                       1350
#define T2OUTPS1                      1351
#define T2OUTPS2                      1352
#define T2OUTPS3                      1353
#define WM0                           1354
#define PR2                           1355
#define WM1                           1356
#define WAIT0                         1357
#define WAIT1                         1358
#define EBDIS                         1359
#define TMR2                          1360
#define T1CON                         1361
#define TMR1ON                        1362
#define TMR1CS                        1363
#define NOT_T1SYNC                    1364
#define T1SYNC                        1365
#define nT1SYNC                       1366
#define T1INSYNC                      1367
#define T1OSCEN                       1368
#define SOSCEN                        1369
#define T1CKPS0                       1370
#define T1CKPS                        1371
#define T1CKPS1                       1372
#define T1RUN                         1373
#define T1RD16                        1374
#define T1CON_RD16                    1375
#define TMR1L                         1376
#define TMR1H                         1377
#define RCON                          1378
#define BOR                           1379
#define NOT_BOR                       1380
#define nBOR                          1381
#define POR                           1382
#define nPOR                          1383
#define NOT_POR                       1384
#define PD                            1385
#define nPD                           1386
#define NOT_PD                        1387
#define nTO                           1388
#define TO                            1389
#define NOT_TO                        1390
#define nRI                           1391
#define NOT_RI                        1392
#define RI                            1393
#define NOT_CM                        1394
#define RCON_CM                       1395
#define nCM                           1396
#define IPEN                          1397
#define WDTCON                        1398
#define SWDTE                         1399
#define SWDTEN                        1400
#define REGSLP                        1401
#define LCDREG                        1402
#define CKSEL                         1403
#define CKSEL0                        1404
#define CKSEL1                        1405
#define MODE13                        1406
#define BIAS0                         1407
#define BIAS                          1408
#define BIAS1                         1409
#define BIAS2                         1410
#define CPEN                          1411
#define OSCCON                        1412
#define SCS0                          1413
#define SCS                           1414
#define SCS1                          1415
#define IOFS                          1416
#define OSTS                          1417
#define IRCF                          1418
#define IRCF0                         1419
#define IRCF1                         1420
#define IRCF2                         1421
#define IDLEN                         1422
#define T0CON                         1423
#define T0PS                          1424
#define T0PS0                         1425
#define T0PS1                         1426
#define T0PS2                         1427
#define PSA                           1428
#define T0SE                          1429
#define T0CS                          1430
#define T08BIT                        1431
#define TMR0ON                        1432
#define TMR0L                         1433
#define TMR0H                         1434
#define STATUS                        1435
#define C                             1436
#define CARRY                         1437
#define DC                            1438
#define ZERO                          1439
#define Z                             1440
#define OV                            1441
#define OVERFLOW                      1442
#define N                             1443
#define NEGATIVE                      1444
#define FSR2L                         1445
#define PLUSW2                        1446
#define PREINC2                       1447
#define POSTDEC2                      1448
#define POSTINC2                      1449
#define INDF2                         1450
#define FSR1L                         1451
#define PLUSW1                        1452
#define PREINC1                       1453
#define POSTDEC1                      1454
#define POSTINC1                      1455
#define INDF1                         1456
#define WREG                          1457
#define FSR0L                         1458
#define PLUSW0                        1459
#define PREINC0                       1460
#define POSTDEC0                      1461
#define POSTINC0                      1462
#define INDF0                         1463
#define INTCON3                       1464
#define INT1IF                        1465
#define INT1F                         1466
#define INT2IF                        1467
#define INT2F                         1468
#define INT3F                         1469
#define INT3IF                        1470
#define INT1E                         1471
#define INT1IE                        1472
#define INT2IE                        1473
#define INT2E                         1474
#define INT3E                         1475
#define INT3IE                        1476
#define INT1P                         1477
#define INT1IP                        1478
#define INT2IP                        1479
#define INT2P                         1480
#define INTCON2                       1481
#define RBIP                          1482
#define INT3IP                        1483
#define INT3P                         1484
#define TMR0IP                        1485
#define T0IP                          1486
#define INTEDG3                       1487
#define INTEDG2                       1488
#define INTEDG1                       1489
#define INTEDG0                       1490
#define RBPU                          1491
#define NOT_RBPU                      1492
#define nRBPU                         1493
#define INTCON                        1494
#define RBIF                          1495
#define INT0F                         1496
#define INT0IF                        1497
#define T0IF                          1498
#define TMR0IF                        1499
#define RBIE                          1500
#define INT0E                         1501
#define INT0IE                        1502
#define T0IE                          1503
#define TMR0IE                        1504
#define PEIE                          1505
#define PEIE_GIEL                     1506
#define GIEL                          1507
#define GIE_GIEH                      1508
#define GIE                           1509
#define GIEH                          1510
#define PRODL                         1511
#define PRODH                         1512
#define TABLAT                        1513
#define TBLPTRL                       1514
#define TBLPTRH                       1515
#define PCL                           1516
#define PCLATH                        1517
#define PCH                           1518
#define SP0                           1519
#define STKPTR                        1520
#define STKPTR0                       1521
#define SP1                           1522
#define STKPTR1                       1523
#define STKPTR2                       1524
#define SP2                           1525
#define SP3                           1526
#define STKPTR3                       1527
#define STKPTR4                       1528
#define SP4                           1529
#define STKUNF                        1530
#define STKOVF                        1531
#define STKFUL                        1532
#define TOSL                          1533
#define TOSH                          1534

#endif // _PIC18F66J90_H_
